Thanks for raising this, but I'm afraid I cannot reproduce it given the information above.

```
terraform {
  required_providers {
    cloudflare = {
      source  = "cloudflare/cloudflare"
      version = "3.9.1"
    }
  }
}

provider "cloudflare" {}

resource "cloudflare_record" "repro_1481" {
  zone_id = var.cloudflare_zone_id
  name    = "repro_1481"
  value   = "10.0.0.8"
  type    = "A"
  ttl     = 3600
}
```

```
$ CLOUDFLARE_API_TOKEN="..." terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.repro_1481 will be created
  + resource "cloudflare_record" "repro_1481" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "repro_1481"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.0.11"
      + zone_id         = "0da42c8d2132a9ddaf714f9e7c920711"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

cloudflare_record.repro_1481: Creating...
cloudflare_record.repro_1481: Creation complete after 1s [id=c59761219f096b89fd14086f2de69044]
```

> Also, is it correct that email also needs to be supplied and the api_token alone is not sufficient?

API tokens do not need an email provided. 

If you're still seeing this issue, can you please provide a minimal reproduction test file? 

As side note, the CI acceptance test suite runs *only* with environment variables so it's likely not the provider broken here but either: your local env not picking up the environment variables, or a typo somewhere.